tdxguiping/ESP32_S3_epaper/main/server_network_sta/server_network_sta.c
#include "server_network_sta.h"

#include <stdbool.h>
#include <stdatomic.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "esp_err.h"
#include "esp_event.h"
#include "esp_log.h"
#include "esp_netif.h"
#include "esp_vfs.h"
#include "esp_wifi.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "mdns.h"
#include "nvs.h"

#include "ch583_wifi_uart_protocol.h"
#include "file_serving_example_common.h"
#include "led_status.h"
#include "server_network_sta_wifi_credential.h"
#include "server_network_sta_wifi_ssid_candidate.h"
#include "server_network_sta_wifi_ssid_candidate_scan.h"
#include "server_network_sta_wifi_ssid_candidate_store.h"

typedef struct {
    char ssid[SERVER_NETWORK_STA_WIFI_SSID_BUFFER_SIZE];
    uint8_t ssid_length;
    char display_ssid[SERVER_NETWORK_STA_WIFI_SSID_BUFFER_SIZE];
    char password[SERVER_NETWORK_STA_WIFI_PASSWORD_BUFFER_SIZE];
    bool is_valid;
} wifi_credential_t;

_Static_assert(sizeof(((wifi_config_t *)0)->sta.ssid) ==
                   SERVER_NETWORK_STA_WIFI_SSID_MAX_BYTES,
               "ESP-IDF WiFi SSID field size changed");
_Static_assert(sizeof(((wifi_config_t *)0)->sta.password) ==
                   SERVER_NETWORK_STA_WIFI_PASSWORD_BUFFER_SIZE,
               "ESP-IDF WiFi password field size changed");

typedef enum {
    WIFI_MANAGER_EVENT_CONNECT = 1,
    WIFI_MANAGER_EVENT_NEW_CREDENTIAL,
    WIFI_MANAGER_EVENT_PROVISIONING,
    WIFI_MANAGER_EVENT_STA_CONNECTED,
    WIFI_MANAGER_EVENT_GOT_IP,
    WIFI_MANAGER_EVENT_LOST_IP,
    WIFI_MANAGER_EVENT_DISCONNECTED,
    WIFI_MANAGER_EVENT_RESYNC,
} wifi_manager_event_type_t;

typedef struct {
    wifi_manager_event_type_t type;
    bool force_reconnect;
    bool suppress_password_log;
    uint32_t request_id;
    uint8_t request_slot;
    int reason;
    int rssi;
    esp_ip4_addr_t ip;
    char base_path[ESP_VFS_PATH_MAX + 1];
} wifi_manager_event_t;

typedef struct {
    StaticSemaphore_t semaphore_buffer;
    SemaphoreHandle_t semaphore;
    uint32_t request_id;
    uint8_t result;
    bool in_use;
} wifi_request_slot_t;

typedef enum {
    WIFI_MANAGER_INIT_NONE = 0,
    WIFI_MANAGER_INIT_IN_PROGRESS,
    WIFI_MANAGER_INIT_READY,
    WIFI_MANAGER_INIT_FAILED,
} wifi_manager_init_state_t;

typedef enum {
    WIFI_AUTH_FAILURE_NONE = 0,
    WIFI_AUTH_FAILURE_HARD,
    WIFI_AUTH_FAILURE_TRANSIENT,
} wifi_auth_failure_class_t;

typedef struct {
    uint32_t connection_generation;
    uint32_t credential_generation;
    uint32_t disconnect_credential_generation;
    server_network_sta_disconnect_purpose_t disconnect_purpose;
    TickType_t expected_disconnect_deadline;
    bool disconnect_was_online;
    uint32_t wifi_retry_streak;
    uint32_t unstable_disconnect_count;
    uint32_t hard_auth_failure_count;
    uint32_t transient_auth_failure_count;
    TickType_t ready_stable_deadline;
    bool ready_stability_pending;
} wifi_manager_context_t;

static const char *TAG = "server_network_sta";
static QueueHandle_t s_wifi_manager_queue;
static TaskHandle_t s_wifi_manager_task;
static SemaphoreHandle_t s_status_mutex;
static StaticSemaphore_t s_status_mutex_buffer;
static server_network_sta_status_t s_status = {
    .state = SERVER_NETWORK_STA_STATE_IDLE,
    .last_result = TDX_JSON_RESULT_WIFI_CONNECT_TIMEOUT,
};
static TickType_t s_wifi_retry_deadline;
static TickType_t s_http_retry_deadline;
static TickType_t s_mdns_retry_deadline;
static TickType_t s_ready_stable_deadline;
static SemaphoreHandle_t s_request_mutex;
static StaticSemaphore_t s_request_mutex_buffer;
static wifi_request_slot_t s_request_slots[SERVER_NETWORK_STA_REQUEST_SLOT_COUNT];
static uint32_t s_next_request_id;
static portMUX_TYPE s_init_lock = portMUX_INITIALIZER_UNLOCKED;
static volatile wifi_manager_init_state_t s_init_state = WIFI_MANAGER_INIT_NONE;
static atomic_bool s_resync_required;
static atomic_bool s_provisioning_required;

static bool s_wifi_stack_ready;
static bool s_wifi_handlers_registered;
static bool s_mdns_initialized;
static bool s_mdns_service_started;
static esp_event_handler_instance_t s_wifi_event_instance;
static esp_event_handler_instance_t s_ip_got_event_instance;
static esp_event_handler_instance_t s_ip_lost_event_instance;

#define SERVER_NETWORK_STA_HARD_AUTH_FAILURE_LIMIT 2
#define SERVER_NETWORK_STA_TRANSIENT_AUTH_FAILURE_LIMIT 3
#define SERVER_NETWORK_STA_INVALID_REQUEST_SLOT UINT8_MAX
#if TDX_AUTO_LIGHT_SLEEP_ENABLE
#define SERVER_NETWORK_STA_CONNECTED_PS WIFI_PS_MAX_MODEM
#else
#define SERVER_NETWORK_STA_CONNECTED_PS WIFI_PS_NONE
#endif

static const uint32_t s_wifi_retry_delay_table_ms[] = {
    1000,
    2000,
    3000,
    3500,
    4000,
    4500,
};

static const uint32_t s_mdns_retry_delay_table_ms[] = {
    5000,
    15000,
    30000,
    60000,
};

static void server_network_sta_manager_task(void *arg);

static void status_lock(void)
{
    if (s_status_mutex != NULL) {
        (void)xSemaphoreTake(s_status_mutex, portMAX_DELAY);
    }
}

static void status_unlock(void)
{
    if (s_status_mutex != NULL) {
        (void)xSemaphoreGive(s_status_mutex);
    }
}

static void status_set_ready_stable_deadline(TickType_t deadline)
{
    status_lock();
    s_ready_stable_deadline = deadline;
    status_unlock();
}

static void status_set_last_result(int result)
{
    status_lock();
    s_status.last_result = result;
    status_unlock();
}

static bool state_has_online_service(server_network_sta_state_t state)
{
    return state == SERVER_NETWORK_STA_STATE_READY ||
           state == SERVER_NETWORK_STA_STATE_GOT_IP ||
           state == SERVER_NETWORK_STA_STATE_STARTING_SERVICES;
}

static bool state_is_connect_flow(server_network_sta_state_t state)
{
    return state == SERVER_NETWORK_STA_STATE_CONNECTING ||
           state == SERVER_NETWORK_STA_STATE_WAITING_IP;
}

static bool state_accepts_sta_connected(server_network_sta_state_t state)
{
    return state == SERVER_NETWORK_STA_STATE_CONNECTING;
}

static bool state_accepts_got_ip(server_network_sta_state_t state)
{
    return state != SERVER_NETWORK_STA_STATE_DISCONNECTING &&
           state != SERVER_NETWORK_STA_STATE_AUTH_FAILED &&
           state != SERVER_NETWORK_STA_STATE_NO_CONFIG &&
           state != SERVER_NETWORK_STA_STATE_FAILED;
}

static bool should_ignore_disconnected_event(server_network_sta_state_t state,
                                             server_network_sta_disconnect_purpose_t purpose)
{
    if (purpose != SERVER_NETWORK_STA_DISCONNECT_NONE) {
        return false;
    }
    return state == SERVER_NETWORK_STA_STATE_IDLE ||
           state == SERVER_NETWORK_STA_STATE_NO_CONFIG ||
           state == SERVER_NETWORK_STA_STATE_AUTH_FAILED ||
           state == SERVER_NETWORK_STA_STATE_FAILED;
}

static void status_enter_connecting(void)
{
    status_lock();
    s_status.state = SERVER_NETWORK_STA_STATE_CONNECTING;
    s_status.retry_type = SERVER_NETWORK_RETRY_NONE;
    s_status.disconnect_purpose = SERVER_NETWORK_STA_DISCONNECT_NONE;
    s_status.ap_connected = false;
    s_status.has_ip = false;
    s_status.http_running = example_file_server_is_running();
    s_status.http_ready = false;
    s_status.mdns_ready = false;
    s_status.ip[0] = '\0';
    s_status.wifi_retry_after_ms = 0;
    s_status.http_retry_count = 0;
    s_status.http_retry_after_ms = 0;
    s_status.mdns_retry_count = 0;
    s_status.mdns_retry_after_ms = 0;
    s_wifi_retry_deadline = 0;
    s_http_retry_deadline = 0;
    s_mdns_retry_deadline = 0;
    status_unlock();
}

static void status_enter_disconnecting(server_network_sta_disconnect_purpose_t purpose)
{
    status_lock();
    s_status.state = SERVER_NETWORK_STA_STATE_DISCONNECTING;
    s_status.retry_type = SERVER_NETWORK_RETRY_NONE;
    s_status.disconnect_purpose = purpose;
    s_status.ap_connected = false;
    s_status.has_ip = false;
    s_status.http_running = example_file_server_is_running();
    s_status.http_ready = false;
    s_status.mdns_ready = false;
    s_status.ip[0] = '\0';
    s_status.wifi_retry_after_ms = 0;
    s_status.http_retry_count = 0;
    s_status.http_retry_after_ms = 0;
    s_status.mdns_retry_count = 0;
    s_status.mdns_retry_after_ms = 0;
    s_wifi_retry_deadline = 0;
    s_http_retry_deadline = 0;
    s_mdns_retry_deadline = 0;
    status_unlock();
}

static void status_enter_waiting_ip(void)
{
    status_lock();
    s_status.state = SERVER_NETWORK_STA_STATE_WAITING_IP;
    s_status.retry_type = SERVER_NETWORK_RETRY_NONE;
    s_status.disconnect_purpose = SERVER_NETWORK_STA_DISCONNECT_NONE;
    s_status.ap_connected = true;
    s_status.has_ip = false;
    s_status.http_running = example_file_server_is_running();
    s_status.http_ready = false;
    s_status.mdns_ready = false;
    s_status.ip[0] = '\0';
    status_unlock();
}

static void status_enter_starting_services(void)
{
    status_lock();
    s_status.state = SERVER_NETWORK_STA_STATE_STARTING_SERVICES;
    s_status.retry_type = SERVER_NETWORK_RETRY_NONE;
    s_status.disconnect_purpose = SERVER_NETWORK_STA_DISCONNECT_NONE;
    s_status.ap_connected = true;
    s_status.has_ip = true;
    s_status.http_running = example_file_server_is_running();
    s_status.http_ready = false;
    s_status.mdns_ready = s_mdns_service_started;
    status_unlock();
}

static void status_enter_idle(void)
{
    status_lock();
    s_status.state = SERVER_NETWORK_STA_STATE_IDLE;
    s_status.retry_type = SERVER_NETWORK_RETRY_NONE;
    s_status.disconnect_purpose = SERVER_NETWORK_STA_DISCONNECT_NONE;
    s_status.ap_connected = false;
    s_status.has_ip = false;
    s_status.http_running = example_file_server_is_running();
    s_status.http_ready = false;
    s_status.mdns_ready = false;
    s_status.ip[0] = '\0';
    status_unlock();
}

static void status_clear_retries(void)
{
    status_lock();
    s_status.retry_type = SERVER_NETWORK_RETRY_NONE;
    s_status.wifi_retry_count = 0;
    s_status.wifi_retry_after_ms = 0;
    s_status.http_retry_count = 0;
    s_status.http_retry_after_ms = 0;
    s_status.mdns_retry_count = 0;
    s_status.mdns_retry_after_ms = 0;
    s_wifi_retry_deadline = 0;
    s_http_retry_deadline = 0;
    s_mdns_retry_deadline = 0;
    status_unlock();
}

