tdxguiping/ESP32_S3_epaper/main/server_network_sta/server_network_sta.c
static void status_enter_wifi_retry(uint32_t retry_count, uint32_t delay_ms,
                                    int reason, int rssi)
{
    status_lock();
    s_status.state = SERVER_NETWORK_STA_STATE_RETRY_WAIT;
    s_status.retry_type = SERVER_NETWORK_RETRY_WIFI;
    s_status.disconnect_purpose = SERVER_NETWORK_STA_DISCONNECT_NONE;
    s_status.wifi_retry_count = retry_count;
    s_status.wifi_retry_after_ms = delay_ms;
    s_status.ap_connected = false;
    s_status.has_ip = false;
    s_status.http_ready = false;
    s_status.mdns_ready = false;
    s_status.ip[0] = '\0';
    s_status.disconnect_reason = reason;
    s_status.rssi = rssi;
    s_status.http_retry_count = 0;
    s_status.http_retry_after_ms = 0;
    s_status.mdns_retry_count = 0;
    s_status.mdns_retry_after_ms = 0;
    s_wifi_retry_deadline = xTaskGetTickCount() + pdMS_TO_TICKS(delay_ms);
    s_http_retry_deadline = 0;
    s_mdns_retry_deadline = 0;
    status_unlock();
}

static void status_enter_service_retry(uint32_t retry_count, uint32_t delay_ms)
{
    status_lock();
    s_status.state = SERVER_NETWORK_STA_STATE_RETRY_WAIT;
    s_status.retry_type = SERVER_NETWORK_RETRY_HTTP;
    s_status.disconnect_purpose = SERVER_NETWORK_STA_DISCONNECT_NONE;
    s_status.http_retry_count = retry_count;
    s_status.http_retry_after_ms = delay_ms;
    s_status.http_ready = false;
    s_http_retry_deadline = xTaskGetTickCount() + pdMS_TO_TICKS(delay_ms);
    status_unlock();
}

static void status_set_mdns_retry(uint32_t retry_count, uint32_t delay_ms)
{
    status_lock();
    s_status.mdns_ready = false;
    s_status.mdns_retry_count = retry_count;
    s_status.mdns_retry_after_ms = delay_ms;
    if (s_status.state == SERVER_NETWORK_STA_STATE_READY) {
        s_status.retry_type = SERVER_NETWORK_RETRY_MDNS;
    }
    s_mdns_retry_deadline = delay_ms == 0 ? 0 :
                            xTaskGetTickCount() + pdMS_TO_TICKS(delay_ms);
    status_unlock();
}

static void status_enter_ready(const esp_ip4_addr_t *ip)
{
    status_lock();
    s_status.state = SERVER_NETWORK_STA_STATE_READY;
    s_status.disconnect_purpose = SERVER_NETWORK_STA_DISCONNECT_NONE;
    s_status.last_result = TDX_JSON_RESULT_OK;
    s_status.ap_connected = true;
    s_status.has_ip = true;
    s_status.http_running = true;
    s_status.http_ready = true;
    s_status.mdns_ready = s_mdns_service_started;
    s_status.wifi_retry_after_ms = 0;
    s_status.http_retry_count = 0;
    s_status.http_retry_after_ms = 0;
    s_wifi_retry_deadline = 0;
    s_http_retry_deadline = 0;
    if (s_mdns_service_started) {
        s_status.retry_type = SERVER_NETWORK_RETRY_NONE;
        s_status.mdns_retry_count = 0;
        s_status.mdns_retry_after_ms = 0;
        s_mdns_retry_deadline = 0;
    } else {
        s_status.retry_type = SERVER_NETWORK_RETRY_MDNS;
    }
    if (ip != NULL) {
        snprintf(s_status.ip, sizeof(s_status.ip), IPSTR, IP2STR(ip));
    }
    status_unlock();
}

static void status_enter_got_ip(const esp_ip4_addr_t *ip)
{
    status_lock();
    s_status.state = SERVER_NETWORK_STA_STATE_GOT_IP;
    s_status.retry_type = SERVER_NETWORK_RETRY_NONE;
    s_status.disconnect_purpose = SERVER_NETWORK_STA_DISCONNECT_NONE;
    s_status.ap_connected = true;
    s_status.has_ip = true;
    s_status.http_ready = false;
    s_status.wifi_retry_after_ms = 0;
    s_status.http_retry_count = 0;
    s_status.http_retry_after_ms = 0;
    s_status.mdns_retry_count = 0;
    s_status.mdns_retry_after_ms = 0;
    s_wifi_retry_deadline = 0;
    s_http_retry_deadline = 0;
    s_mdns_retry_deadline = 0;
    if (ip != NULL) {
        snprintf(s_status.ip, sizeof(s_status.ip), IPSTR, IP2STR(ip));
    }
    status_unlock();
}

static void status_enter_terminal(server_network_sta_state_t state, int result,
                                  int reason, int rssi)
{
    status_lock();
    s_status.state = state;
    s_status.last_result = result;
    s_status.retry_type = SERVER_NETWORK_RETRY_NONE;
    s_status.disconnect_purpose = SERVER_NETWORK_STA_DISCONNECT_NONE;
    s_status.wifi_retry_count = 0;
    s_status.wifi_retry_after_ms = 0;
    s_status.http_retry_count = 0;
    s_status.http_retry_after_ms = 0;
    s_status.mdns_retry_count = 0;
    s_status.mdns_retry_after_ms = 0;
    s_status.ap_connected = false;
    s_status.has_ip = false;
    s_status.http_running = example_file_server_is_running();
    s_status.http_ready = false;
    s_status.mdns_ready = false;
    s_status.ip[0] = '\0';
    s_status.disconnect_reason = reason;
    s_status.rssi = rssi;
    s_wifi_retry_deadline = 0;
    s_http_retry_deadline = 0;
    s_mdns_retry_deadline = 0;
    status_unlock();
}

static bool should_log_retry(uint32_t retry_count)
{
    return retry_count <= 5 || (retry_count % 10) == 0;
}

static uint32_t retry_delay_ms(uint32_t retry_count)
{
    size_t index = retry_count;
    size_t count = sizeof(s_wifi_retry_delay_table_ms) / sizeof(s_wifi_retry_delay_table_ms[0]);
    if (index >= count) {
        index = count - 1;
    }
    return s_wifi_retry_delay_table_ms[index];
}

static uint32_t mdns_retry_delay_ms(uint32_t retry_count)
{
    size_t index = retry_count;
    size_t count = sizeof(s_mdns_retry_delay_table_ms) / sizeof(s_mdns_retry_delay_table_ms[0]);
    if (index >= count) {
        index = count - 1;
    }
    return s_mdns_retry_delay_table_ms[index];
}

static void set_wifi_ps(wifi_ps_type_t ps_type, const char *stage)
{
    esp_err_t ret = esp_wifi_set_ps(ps_type);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "WiFi PS failed stage=%s type=%d ret=%s",
                 stage, (int)ps_type, esp_err_to_name(ret));
    } else {
        ESP_LOGD(TAG, "WiFi PS stage=%s type=%d", stage, (int)ps_type);
    }
}

static wifi_auth_failure_class_t classify_auth_failure(int reason)
{
    switch (reason) {
    case WIFI_REASON_AUTH_FAIL:
    case WIFI_REASON_NO_AP_FOUND_W_COMPATIBLE_SECURITY:
    case WIFI_REASON_NO_AP_FOUND_IN_AUTHMODE_THRESHOLD:
        return WIFI_AUTH_FAILURE_HARD;
    case WIFI_REASON_AUTH_EXPIRE:
    case WIFI_REASON_4WAY_HANDSHAKE_TIMEOUT:
    case WIFI_REASON_GROUP_KEY_UPDATE_TIMEOUT:
    case WIFI_REASON_HANDSHAKE_TIMEOUT:
        return WIFI_AUTH_FAILURE_TRANSIENT;
    default:
        return WIFI_AUTH_FAILURE_NONE;
    }
}

static void reset_connection_health(wifi_manager_context_t *context)
{
    if (context == NULL) {
        return;
    }
    context->wifi_retry_streak = 0;
    context->unstable_disconnect_count = 0;
    context->hard_auth_failure_count = 0;
    context->transient_auth_failure_count = 0;
    context->ready_stability_pending = false;
    context->ready_stable_deadline = 0;
    status_set_ready_stable_deadline(0);
}

static void begin_connection_attempt(wifi_manager_context_t *context)
{
    context->connection_generation++;
    status_lock();
    s_status.connection_generation = context->connection_generation;
    s_status.credential_generation = context->credential_generation;
    status_unlock();
}

static uint32_t next_wifi_retry(wifi_manager_context_t *context, bool disconnected_after_ip,
                                uint32_t *retry_count)
{
    if (disconnected_after_ip) {
        context->unstable_disconnect_count++;
        if (context->wifi_retry_streak < context->unstable_disconnect_count) {
            context->wifi_retry_streak = context->unstable_disconnect_count;
        }
    } else {
        context->wifi_retry_streak++;
    }
    if (context->wifi_retry_streak == 0) {
        context->wifi_retry_streak = 1;
    }
    if (retry_count != NULL) {
        *retry_count = context->wifi_retry_streak;
    }
    return retry_delay_ms(context->wifi_retry_streak - 1);
}

static void clear_expected_disconnect(wifi_manager_context_t *context)
{
    context->disconnect_purpose = SERVER_NETWORK_STA_DISCONNECT_NONE;
    context->disconnect_credential_generation = 0;
    context->expected_disconnect_deadline = 0;
    context->disconnect_was_online = false;
    status_lock();
    s_status.disconnect_purpose = SERVER_NETWORK_STA_DISCONNECT_NONE;
    status_unlock();
}

static esp_err_t start_expected_disconnect(wifi_manager_context_t *context,
                                           server_network_sta_disconnect_purpose_t purpose)
{
    status_lock();
    context->disconnect_was_online = s_status.has_ip ||
                                     state_has_online_service(s_status.state);
    status_unlock();
    context->disconnect_purpose = purpose;
    context->disconnect_credential_generation = context->credential_generation;
    context->expected_disconnect_deadline =
        xTaskGetTickCount() + pdMS_TO_TICKS(SERVER_NETWORK_STA_EXPECTED_DISCONNECT_TIMEOUT_MS);
    status_enter_disconnecting(purpose);
    esp_err_t ret = esp_wifi_disconnect();
    if (ret != ESP_OK) {
        clear_expected_disconnect(context);
    }
    return ret;
}

static const char *disconnect_reason_name(int reason)
{
    switch (reason) {
    case WIFI_REASON_AUTH_EXPIRE: return "AUTH_EXPIRE";
    case WIFI_REASON_ASSOC_LEAVE: return "ASSOC_LEAVE";
    case WIFI_REASON_4WAY_HANDSHAKE_TIMEOUT: return "4WAY_HANDSHAKE_TIMEOUT";
    case WIFI_REASON_GROUP_KEY_UPDATE_TIMEOUT: return "GROUP_KEY_TIMEOUT";
    case WIFI_REASON_BEACON_TIMEOUT: return "BEACON_TIMEOUT";
    case WIFI_REASON_NO_AP_FOUND: return "NO_AP_FOUND";
    case WIFI_REASON_AUTH_FAIL: return "AUTH_FAIL";
    case WIFI_REASON_ASSOC_FAIL: return "ASSOC_FAIL";
    case WIFI_REASON_HANDSHAKE_TIMEOUT: return "HANDSHAKE_TIMEOUT";
    case WIFI_REASON_CONNECTION_FAIL: return "CONNECTION_FAIL";
    case WIFI_REASON_NO_AP_FOUND_W_COMPATIBLE_SECURITY: return "SECURITY_MISMATCH";
    default: return "OTHER";
    }
}

static void parse_zero_terminated_blob(const uint8_t *blob_data, size_t blob_len,
                                       char *out, size_t out_size)
{
    size_t copy_len = 0;
    if (blob_data == NULL || out == NULL || out_size == 0) {
        return;
    }
    while (copy_len + 1 < out_size && copy_len < blob_len && blob_data[copy_len] != '\0') {
        out[copy_len] = (char)blob_data[copy_len];
        copy_len++;
    }
    out[copy_len] = '\0';
}

static esp_err_t read_nvs_blob_string(nvs_handle_t handle, const char *key,
                                      char *out, size_t out_size)
{
    size_t blob_len = 0;
    esp_err_t ret = nvs_get_blob(handle, key, NULL, &blob_len);
    if (ret != ESP_OK || blob_len == 0) {
        return ret != ESP_OK ? ret : ESP_ERR_INVALID_SIZE;
    }
    if (blob_len > out_size) {
        return ESP_ERR_INVALID_SIZE;
    }

    uint8_t *blob = malloc(blob_len);
    if (blob == NULL) {
        return ESP_ERR_NO_MEM;
    }
    ret = nvs_get_blob(handle, key, blob, &blob_len);
    if (ret == ESP_OK) {
        if (memchr(blob, '\0', blob_len) == NULL && blob_len >= out_size) {
            ret = ESP_ERR_INVALID_SIZE;
        } else {
            parse_zero_terminated_blob(blob, blob_len, out, out_size);
        }
    }
    free(blob);
    return ret;
}

static esp_err_t read_nvs_string(nvs_handle_t handle, const char *key,
                                 char *out, size_t out_size)
{
    size_t len = out_size;
    esp_err_t ret = nvs_get_str(handle, key, out, &len);
    if (ret == ESP_OK) {
        out[out_size - 1] = '\0';
    }
    return ret;
}

