tdxguiping/ESP32_S3_epaper/main/server_network_sta/server_network_sta.c
static bool credential_from_candidate_config(
    const server_network_sta_ssid_candidate_config_t *config,
    wifi_credential_t *credential)
{
    if (config == NULL || credential == NULL || config->selected_index < 0 ||
        config->selected_index >= config->candidate_count ||
        ServerNetworkStaWifiSsidCandidate_ValidateConfig(config) !=
            SERVER_NETWORK_STA_SSID_CANDIDATE_OK) {
        return false;
    }

    const server_network_sta_ssid_candidate_t *selected =
        &config->candidates[(uint8_t)config->selected_index];
    memset(credential, 0, sizeof(*credential));
    memcpy(credential->ssid, selected->bytes, selected->length);
    credential->ssid_length = selected->length;
    strlcpy(credential->display_ssid, config->display_ssid,
            sizeof(credential->display_ssid));
    strlcpy(credential->password, config->password,
            sizeof(credential->password));
    credential->is_valid = true;
    return true;
}

static esp_err_t select_candidate_credential(
    server_network_sta_ssid_candidate_config_t *config,
    wifi_credential_t *credential)
{
    server_network_sta_ssid_scan_result_t scan_result = {0};
    esp_err_t ret = ServerNetworkStaWifiSsidCandidateScan_Select(
        config, &scan_result);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "WiFi SSID candidate not selected country=%s elapsed_ms=%lu ret=%s",
                 config->country, (unsigned long)scan_result.elapsed_ms,
                 esp_err_to_name(ret));
        return ret;
    }
    ret = ServerNetworkStaWifiSsidCandidateStore_Select(
        config, scan_result.selected_index);
    if (ret == ESP_OK &&
        !credential_from_candidate_config(config, credential)) {
        ret = ESP_FAIL;
    }
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "WiFi SSID candidate save failed index=%u ret=%s",
                 (unsigned int)scan_result.selected_index,
                 esp_err_to_name(ret));
        return ret;
    }
    ESP_LOGI(TAG,
             "WiFi SSID selected display=%s encoding=%s band=%s channel=%u rssi=%d elapsed_ms=%lu",
             credential->display_ssid,
             ServerNetworkStaWifiSsidCandidate_EncodingName(
                 config->candidates[scan_result.selected_index].encoding),
             scan_result.is_5ghz ? "5GHz" : "2.4GHz",
             (unsigned int)scan_result.channel,
             (int)scan_result.rssi,
             (unsigned long)scan_result.elapsed_ms);
    return ESP_OK;
}

static wifi_credential_t read_saved_wifi(bool suppress_password_log)
{
    wifi_credential_t credential = {0};
    nvs_handle_t handle = 0;
    esp_err_t ret = nvs_open("wifi", NVS_READONLY, &handle);
    if (ret == ESP_OK) {
        esp_err_t ssid_ret = read_nvs_string(handle, "ssid", credential.ssid,
                                             sizeof(credential.ssid));
        esp_err_t pass_ret = read_nvs_string(handle, "password", credential.password,
                                             sizeof(credential.password));
        nvs_close(handle);
        server_network_sta_wifi_credential_result_t validation =
            ServerNetworkStaWifiCredential_Validate(credential.ssid,
                                                    credential.password);
        if (ssid_ret == ESP_OK && pass_ret == ESP_OK &&
            validation == SERVER_NETWORK_STA_WIFI_CREDENTIAL_OK) {
            credential.ssid_length = strlen(credential.ssid);
            strlcpy(credential.display_ssid, credential.ssid,
                    sizeof(credential.display_ssid));
            credential.is_valid = true;
#if SERVER_NETWORK_STA_LOG_PASSWORD_PLAINTEXT
            if (!suppress_password_log) {
                ESP_LOGI(TAG, "WiFi credential loaded ssid=%s password=%s",
                         credential.ssid, credential.password);
            } else {
                ESP_LOGI(TAG, "WiFi credential loaded ssid=%s",
                         credential.ssid);
            }
#else
            ESP_LOGI(TAG, "WiFi credential loaded ssid=%s",
                     credential.ssid);
#endif
            return credential;
        }
        if (ssid_ret == ESP_OK && pass_ret == ESP_OK) {
            ESP_LOGW(TAG,
                     "WiFi credential ignored namespace=wifi reason=%s ssid_len=%u password_len=%u",
                     ServerNetworkStaWifiCredential_ResultName(validation),
                     (unsigned int)strlen(credential.ssid),
                     (unsigned int)strlen(credential.password));
        }
        memset(&credential, 0, sizeof(credential));
    }

    ret = nvs_open("nvs.net80211", NVS_READONLY, &handle);
    if (ret != ESP_OK) {
        return credential;
    }
    esp_err_t ssid_ret = read_nvs_blob_string(handle, "sta.ssid", credential.ssid,
                                              sizeof(credential.ssid));
    esp_err_t pass_ret = read_nvs_blob_string(handle, "sta.pswd", credential.password,
                                              sizeof(credential.password));
    nvs_close(handle);
    server_network_sta_wifi_credential_result_t validation =
        ServerNetworkStaWifiCredential_Validate(credential.ssid,
                                                credential.password);
    credential.is_valid = ssid_ret == ESP_OK && pass_ret == ESP_OK &&
                          validation == SERVER_NETWORK_STA_WIFI_CREDENTIAL_OK;
    if (credential.is_valid) {
        credential.ssid_length = strlen(credential.ssid);
        strlcpy(credential.display_ssid, credential.ssid,
                sizeof(credential.display_ssid));
#if SERVER_NETWORK_STA_LOG_PASSWORD_PLAINTEXT
        if (!suppress_password_log) {
            ESP_LOGI(TAG, "WiFi credential loaded ssid=%s password=%s",
                     credential.ssid, credential.password);
        } else {
            ESP_LOGI(TAG, "WiFi credential loaded ssid=%s",
                     credential.ssid);
        }
#else
        ESP_LOGI(TAG, "WiFi credential loaded ssid=%s",
                 credential.ssid);
#endif
    } else if (ssid_ret == ESP_OK && pass_ret == ESP_OK) {
        ESP_LOGW(TAG,
                 "WiFi credential ignored namespace=nvs.net80211 reason=%s ssid_len=%u password_len=%u",
                 ServerNetworkStaWifiCredential_ResultName(validation),
                 (unsigned int)strlen(credential.ssid),
                 (unsigned int)strlen(credential.password));
    }
    return credential;
}

