tdxguiping/ESP32_S3_epaper/main/server_network_sta/server_network_sta.c
static esp_err_t mdns_start_once(void)
{
    if (s_mdns_service_started) {
        return ESP_OK;
    }
    esp_err_t ret = ESP_OK;
    if (!s_mdns_initialized) {
        ret = mdns_init();
        if (ret != ESP_OK) {
            return ret;
        }
        s_mdns_initialized = true;
    }
    ret = mdns_hostname_set(USER_MDNS_HOSTNAME);
    if (ret != ESP_OK) {
        return ret;
    }
    ret = mdns_instance_name_set(USER_MDNS_INSTANCE_NAME);
    if (ret != ESP_OK) {
        return ret;
    }
    ret = mdns_service_add(NULL, "_http", "_tcp", 80, NULL, 0);
    if (ret == ESP_ERR_INVALID_ARG &&
        mdns_service_exists("_http", "_tcp", USER_MDNS_HOSTNAME)) {
        ret = ESP_OK;
    }
    if (ret == ESP_OK) {
        s_mdns_service_started = true;
        ESP_LOGI(TAG, "mDNS ready host=%s.local", USER_MDNS_HOSTNAME);
        return ESP_OK;
    }
    return ret;
}

static esp_err_t file_server_start_once(const char *base_path)
{
    if (example_file_server_is_ready()) {
        return ESP_OK;
    }
    esp_err_t ret = example_start_file_server(base_path);
    bool ready = ret == ESP_OK && example_file_server_is_ready();
    return ready ? ESP_OK : (ret == ESP_OK ? ESP_FAIL : ret);
}

static bool physical_link_has_ip(esp_ip4_addr_t *ip)
{
    esp_netif_ip_info_t info = {0};
    wifi_ap_record_t ap = {0};
    esp_netif_t *netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    bool ready = netif != NULL &&
                 esp_wifi_sta_get_ap_info(&ap) == ESP_OK &&
                 esp_netif_get_ip_info(netif, &info) == ESP_OK &&
                 info.ip.addr != 0;
    if (ready && ip != NULL) {
        *ip = info.ip;
    }
    return ready;
}

static void post_manager_event(const wifi_manager_event_t *event)
{
    if (s_wifi_manager_queue == NULL || event == NULL) {
        return;
    }
    if (xQueueSend(s_wifi_manager_queue, event, 0) != pdTRUE) {
        if (event->type == WIFI_MANAGER_EVENT_PROVISIONING) {
            atomic_store(&s_provisioning_required, true);
        } else {
            atomic_store(&s_resync_required, true);
        }
        ESP_LOGE(TAG, "WiFi manager queue full event=%d", (int)event->type);
    }
}

static void wifi_event_handler(void *arg, esp_event_base_t base, int32_t id, void *data)
{
    (void)arg;
    wifi_manager_event_t event = {0};

    if (base == WIFI_EVENT && id == WIFI_EVENT_STA_CONNECTED) {
        event.type = WIFI_MANAGER_EVENT_STA_CONNECTED;
    } else if (base == WIFI_EVENT && id == WIFI_EVENT_STA_DISCONNECTED) {
        wifi_event_sta_disconnected_t *disconnected = data;
        event.type = WIFI_MANAGER_EVENT_DISCONNECTED;
        event.reason = disconnected != NULL ? disconnected->reason : -1;
        event.rssi = disconnected != NULL ? disconnected->rssi : 0;
    } else if (base == IP_EVENT && id == IP_EVENT_STA_GOT_IP) {
        ip_event_got_ip_t *got_ip = data;
        event.type = WIFI_MANAGER_EVENT_GOT_IP;
        if (got_ip != NULL) {
            event.ip = got_ip->ip_info.ip;
        }
    } else if (base == IP_EVENT && id == IP_EVENT_STA_LOST_IP) {
        event.type = WIFI_MANAGER_EVENT_LOST_IP;
    } else {
        return;
    }
    post_manager_event(&event);
}

static esp_err_t ensure_wifi_stack(void)
{
    if (s_wifi_stack_ready) {
        return ESP_OK;
    }
    esp_err_t ret = esp_netif_init();
    if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
        return ret;
    }
    if (esp_netif_get_handle_from_ifkey("WIFI_STA_DEF") == NULL &&
        esp_netif_create_default_wifi_sta() == NULL) {
        return ESP_ERR_NO_MEM;
    }

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ret = esp_wifi_init(&cfg);
    if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
        return ret;
    }
    if (!s_wifi_handlers_registered) {
        ret = esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID,
                                                  wifi_event_handler, NULL,
                                                  &s_wifi_event_instance);
        if (ret == ESP_OK) {
            ret = esp_event_handler_instance_register(IP_EVENT, IP_EVENT_STA_GOT_IP,
                                                      wifi_event_handler, NULL,
                                                      &s_ip_got_event_instance);
        }
        if (ret == ESP_OK) {
            ret = esp_event_handler_instance_register(IP_EVENT, IP_EVENT_STA_LOST_IP,
                                                      wifi_event_handler, NULL,
                                                      &s_ip_lost_event_instance);
        }
        if (ret != ESP_OK) {
            if (s_ip_lost_event_instance != NULL) {
                (void)esp_event_handler_instance_unregister(
                    IP_EVENT, IP_EVENT_STA_LOST_IP, s_ip_lost_event_instance);
                s_ip_lost_event_instance = NULL;
            }
            if (s_ip_got_event_instance != NULL) {
                (void)esp_event_handler_instance_unregister(
                    IP_EVENT, IP_EVENT_STA_GOT_IP, s_ip_got_event_instance);
                s_ip_got_event_instance = NULL;
            }
            if (s_wifi_event_instance != NULL) {
                (void)esp_event_handler_instance_unregister(
                    WIFI_EVENT, ESP_EVENT_ANY_ID, s_wifi_event_instance);
                s_wifi_event_instance = NULL;
            }
            return ret;
        }
        s_wifi_handlers_registered = true;
    }
    ret = esp_wifi_set_mode(WIFI_MODE_STA);
    if (ret != ESP_OK) {
        return ret;
    }
    ret = esp_wifi_start();
    if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
        return ret;
    }
    s_wifi_stack_ready = true;
    return ESP_OK;
}

static esp_err_t apply_wifi_config(const wifi_credential_t *credential)
{
    if (credential == NULL || !credential->is_valid ||
        credential->ssid_length == 0U ||
        credential->ssid_length > SERVER_NETWORK_STA_WIFI_SSID_MAX_BYTES) {
        return ESP_ERR_INVALID_ARG;
    }
    server_network_sta_wifi_credential_result_t validation =
        ServerNetworkStaWifiCredential_Validate(credential->display_ssid,
                                                credential->password);
    if (validation != SERVER_NETWORK_STA_WIFI_CREDENTIAL_OK) {
        ESP_LOGE(TAG,
                 "WiFi credential apply rejected reason=%s ssid_len=%u password_len=%u",
                 ServerNetworkStaWifiCredential_ResultName(validation),
                 (unsigned int)credential->ssid_length,
                 (unsigned int)strlen(credential->password));
        return ESP_ERR_INVALID_ARG;
    }

