tdxguiping/ESP32_S3_epaper/main/server_network_sta/server_network_sta.c
    wifi_config_t config = {0};
    memcpy(config.sta.ssid, credential->ssid, credential->ssid_length);
    memcpy(config.sta.password, credential->password,
           strlen(credential->password));
    config.sta.scan_method = WIFI_FAST_SCAN;
    config.sta.failure_retry_cnt = 0;
    config.sta.channel = SERVER_NETWORK_STA_WIFI_CHANNEL_HINT;
    config.sta.pmf_cfg.capable = true;
    config.sta.pmf_cfg.required = false;
    return esp_wifi_set_config(WIFI_IF_STA, &config);
}

static bool same_active_config(const wifi_credential_t *credential)
{
    wifi_config_t current = {0};
    wifi_config_t expected = {0};
    if (credential == NULL || !credential->is_valid ||
        credential->ssid_length == 0U ||
        credential->ssid_length > SERVER_NETWORK_STA_WIFI_SSID_MAX_BYTES ||
        ServerNetworkStaWifiCredential_Validate(
            credential->display_ssid, credential->password) !=
            SERVER_NETWORK_STA_WIFI_CREDENTIAL_OK) {
        return false;
    }

    memcpy(expected.sta.ssid, credential->ssid, credential->ssid_length);
    memcpy(expected.sta.password, credential->password,
           strlen(credential->password));
    return esp_wifi_get_config(WIFI_IF_STA, &current) == ESP_OK &&
           memcmp(current.sta.ssid, expected.sta.ssid,
                  sizeof(current.sta.ssid)) == 0 &&
           memcmp(current.sta.password, expected.sta.password,
                  sizeof(current.sta.password)) == 0;
}

static bool allocate_request_slot(uint8_t *slot_index, uint32_t *request_id)
{
    if (slot_index == NULL || request_id == NULL || s_request_mutex == NULL) {
        return false;
    }
    (void)xSemaphoreTake(s_request_mutex, portMAX_DELAY);
    for (uint8_t i = 0; i < sizeof(s_request_slots) / sizeof(s_request_slots[0]); i++) {
        wifi_request_slot_t *slot = &s_request_slots[i];
        if (!slot->in_use) {
            while (xSemaphoreTake(slot->semaphore, 0) == pdTRUE) {
            }
            slot->in_use = true;
            slot->request_id = ++s_next_request_id;
            slot->result = SERVER_NETWORK_STA_CONNECT_FAIL;
            *slot_index = i;
            *request_id = slot->request_id;
            (void)xSemaphoreGive(s_request_mutex);
            return true;
        }
    }
    (void)xSemaphoreGive(s_request_mutex);
    return false;
}

static void complete_pending_request(uint8_t *slot_index, uint32_t *request_id,
                                     uint8_t result)
{
    if (slot_index == NULL || request_id == NULL ||
        *slot_index == SERVER_NETWORK_STA_INVALID_REQUEST_SLOT ||
        *slot_index >= sizeof(s_request_slots) / sizeof(s_request_slots[0])) {
        return;
    }
    (void)xSemaphoreTake(s_request_mutex, portMAX_DELAY);
    wifi_request_slot_t *slot = &s_request_slots[*slot_index];
    if (slot->in_use && slot->request_id == *request_id) {
        slot->result = result;
        (void)xSemaphoreGive(slot->semaphore);
    }
    (void)xSemaphoreGive(s_request_mutex);
    *slot_index = SERVER_NETWORK_STA_INVALID_REQUEST_SLOT;
    *request_id = 0;
}

static void complete_pending_requests(uint8_t *primary_slot, uint32_t *primary_id,
                                      uint8_t *coalesced_slot, uint32_t *coalesced_id,
                                      uint8_t result)
{
    complete_pending_request(primary_slot, primary_id, result);
    complete_pending_request(coalesced_slot, coalesced_id, result);
}

static void server_network_sta_manager_task(void *arg)
{
    (void)arg;
    wifi_credential_t credential = {0};
    char base_path[ESP_VFS_PATH_MAX + 1] = "/data";
    uint8_t pending_request_slot = SERVER_NETWORK_STA_INVALID_REQUEST_SLOT;
    uint32_t pending_request_id = 0;
    uint8_t coalesced_request_slot = SERVER_NETWORK_STA_INVALID_REQUEST_SLOT;
    uint32_t coalesced_request_id = 0;
    wifi_manager_context_t context = {0};
    uint32_t http_retry_count = 0;
    uint32_t mdns_retry_count = 0;
    TickType_t connection_deadline = 0;
    bool connection_enabled = false;
    server_network_sta_ssid_candidate_config_t candidate_config = {
        .selected_index = -1,
    };
    bool candidate_config_valid = false;
    bool candidate_selection_pending = false;

    while (true) {
        TickType_t wait_ticks = portMAX_DELAY;
        server_network_sta_status_t snapshot = {0};
        (void)ServerNetworkSta_GetStatus(&snapshot);
        TickType_t now = xTaskGetTickCount();
        TickType_t state_deadline = 0;
        if (snapshot.state == SERVER_NETWORK_STA_STATE_CONNECTING ||
            snapshot.state == SERVER_NETWORK_STA_STATE_WAITING_IP) {
            state_deadline = connection_deadline;
        } else if (snapshot.state == SERVER_NETWORK_STA_STATE_RETRY_WAIT) {
            state_deadline = snapshot.retry_type == SERVER_NETWORK_RETRY_HTTP
                                 ? s_http_retry_deadline : s_wifi_retry_deadline;
        }
        if (state_deadline != 0) {
            wait_ticks = (int32_t)(state_deadline - now) > 0 ? state_deadline - now : 0;
        }
        if (connection_enabled && snapshot.has_ip && !s_mdns_service_started &&
            s_mdns_retry_deadline != 0) {
            TickType_t mdns_wait = (int32_t)(s_mdns_retry_deadline - now) > 0
                                      ? s_mdns_retry_deadline - now : 0;
            if (wait_ticks == portMAX_DELAY || mdns_wait < wait_ticks) {
                wait_ticks = mdns_wait;
            }
        }
        if (context.disconnect_purpose != SERVER_NETWORK_STA_DISCONNECT_NONE &&
            context.expected_disconnect_deadline != 0) {
            TickType_t disconnect_wait =
                (int32_t)(context.expected_disconnect_deadline - now) > 0
                    ? context.expected_disconnect_deadline - now : 0;
            if (wait_ticks == portMAX_DELAY || disconnect_wait < wait_ticks) {
                wait_ticks = disconnect_wait;
            }
        }
        if (context.ready_stability_pending && context.ready_stable_deadline != 0) {
            TickType_t stable_wait = (int32_t)(context.ready_stable_deadline - now) > 0
                                         ? context.ready_stable_deadline - now : 0;
            if (wait_ticks == portMAX_DELAY || stable_wait < wait_ticks) {
                wait_ticks = stable_wait;
            }
        }

