tdxguiping/ESP32_S3_epaper/main/server_network_sta/server_network_sta.c
        wifi_manager_event_t event = {0};
        bool have_event = false;
        if (atomic_exchange(&s_provisioning_required, false)) {
            event.type = WIFI_MANAGER_EVENT_PROVISIONING;
            have_event = true;
        } else if (atomic_exchange(&s_resync_required, false)) {
            event.type = WIFI_MANAGER_EVENT_RESYNC;
            have_event = true;
        }
        if (!have_event && xQueueReceive(s_wifi_manager_queue, &event, wait_ticks) != pdTRUE) {
            now = xTaskGetTickCount();
            if (context.ready_stability_pending &&
                (int32_t)(now - context.ready_stable_deadline) >= 0 &&
                snapshot.state == SERVER_NETWORK_STA_STATE_READY && physical_link_has_ip(NULL)) {
                reset_connection_health(&context);
                status_lock();
                s_status.wifi_retry_count = 0;
                s_status.wifi_retry_after_ms = 0;
                status_unlock();
                ESP_LOGI(TAG, "WiFi READY stable_ms=%u; retry/auth counters reset",
                         SERVER_NETWORK_STA_READY_STABLE_RESET_MS);
                continue;
            }
            if (context.disconnect_purpose != SERVER_NETWORK_STA_DISCONNECT_NONE &&
                (int32_t)(now - context.expected_disconnect_deadline) >= 0) {
                server_network_sta_disconnect_purpose_t purpose = context.disconnect_purpose;
                uint32_t disconnect_credential_generation =
                    context.disconnect_credential_generation;
                clear_expected_disconnect(&context);
                wifi_ap_record_t ap = {0};
                bool ap_still_connected = esp_wifi_sta_get_ap_info(&ap) == ESP_OK;
                if (ap_still_connected) {
                    esp_ip4_addr_t current_ip = {0};
                    if (purpose != SERVER_NETWORK_STA_DISCONNECT_RECONFIGURE &&
                        physical_link_has_ip(&current_ip)) {
                        atomic_store(&s_resync_required, true);
                        ESP_LOGI(TAG, "WiFi recovered before disconnect timeout");
                        continue;
                    }
                    esp_err_t disconnect_ret = start_expected_disconnect(&context, purpose);
                    if (disconnect_ret == ESP_OK) {
                        ESP_LOGD(TAG, "WiFi disconnect pending purpose=%d; retry command",
                                 (int)purpose);
                        continue;
                    }
                }
                if (purpose == SERVER_NETWORK_STA_DISCONNECT_RECONFIGURE) {
                    if (disconnect_credential_generation != context.credential_generation) {
                        ESP_LOGD(TAG, "Ignore obsolete reconfigure timeout credential_gen=%lu active=%lu",
                                 (unsigned long)disconnect_credential_generation,
                                 (unsigned long)context.credential_generation);
                        continue;
                    }
                    esp_err_t ret = ESP_OK;
                    if (candidate_selection_pending) {
                        ret = select_candidate_credential(&candidate_config,
                                                          &credential);
                        if (ret == ESP_OK) {
                            candidate_selection_pending = false;
                        }
                    }
                    if (ret == ESP_OK) {
                        ret = apply_wifi_config(&credential);
                    }
                    if (ret == ESP_OK) {
                        begin_connection_attempt(&context);
                        set_wifi_ps(WIFI_PS_NONE, "reconfigure_timeout");
                        status_enter_connecting();
                        ret = esp_wifi_connect();
                        connection_deadline = now + pdMS_TO_TICKS(SERVER_NETWORK_STA_CONNECT_FLOW_TIMEOUT_MS);
                    }
                    if (ret != ESP_OK) {
                        uint32_t retry_count = 0;
                        uint32_t delay_ms = next_wifi_retry(&context, false, &retry_count);
                        status_enter_wifi_retry(retry_count, delay_ms, -5, 0);
                        if (should_log_retry(retry_count)) {
                            ESP_LOGW(TAG, "WiFi reconfigure timeout recovery failed retry=%lu "
                                     "delay_ms=%lu ret=%s",
                                     (unsigned long)retry_count, (unsigned long)delay_ms,
                                     esp_err_to_name(ret));
                        }
                    }
                } else if (purpose == SERVER_NETWORK_STA_DISCONNECT_DHCP_RECOVERY ||
                           purpose == SERVER_NETWORK_STA_DISCONNECT_CONNECT_RECOVERY) {
                    uint32_t retry_count = 0;
                    uint32_t delay_ms = next_wifi_retry(
                        &context, purpose == SERVER_NETWORK_STA_DISCONNECT_DHCP_RECOVERY,
                        &retry_count);
                    status_enter_wifi_retry(retry_count, delay_ms, -3, 0);
                } else if (purpose == SERVER_NETWORK_STA_DISCONNECT_PROVISIONING) {
                    status_enter_idle();
                } else if (purpose == SERVER_NETWORK_STA_DISCONNECT_NO_CONFIG) {
                    status_enter_terminal(SERVER_NETWORK_STA_STATE_NO_CONFIG,
                                          TDX_JSON_RESULT_WIFI_CONNECT_TIMEOUT, 0, 0);
                }
                continue;
            }
            if (connection_enabled && snapshot.has_ip && !s_mdns_service_started &&
                s_mdns_retry_deadline != 0 &&
                (int32_t)(now - s_mdns_retry_deadline) >= 0) {
                esp_err_t mdns_ret = mdns_start_once();
                if (mdns_ret == ESP_OK) {
                    mdns_retry_count = 0;
                    status_set_mdns_retry(0, 0);
                    status_lock();
                    s_status.mdns_ready = true;
                    if (s_status.state == SERVER_NETWORK_STA_STATE_READY) {
                        s_status.retry_type = SERVER_NETWORK_RETRY_NONE;
                    }
                    status_unlock();
                } else {
                    uint32_t delay_ms = mdns_retry_delay_ms(mdns_retry_count++);
                    status_set_mdns_retry(mdns_retry_count, delay_ms);
                    if (should_log_retry(mdns_retry_count)) {
                        ESP_LOGW(TAG, "mDNS retry=%lu delay_ms=%lu ret=%s",
                                 (unsigned long)mdns_retry_count,
                                 (unsigned long)delay_ms, esp_err_to_name(mdns_ret));
                    }
                }
                continue;
            }
            if (snapshot.state == SERVER_NETWORK_STA_STATE_RETRY_WAIT) {
                if (snapshot.retry_type == SERVER_NETWORK_RETRY_HTTP) {
                    status_enter_starting_services();
                    esp_err_t http_ret = file_server_start_once(base_path);
                    esp_ip4_addr_t ip = {0};
                    if (http_ret == ESP_OK && physical_link_has_ip(&ip)) {
                        status_enter_ready(&ip);
                        context.ready_stability_pending = true;
                        context.ready_stable_deadline = xTaskGetTickCount() +
                            pdMS_TO_TICKS(SERVER_NETWORK_STA_READY_STABLE_RESET_MS);
                        status_set_ready_stable_deadline(context.ready_stable_deadline);
                        UserLedStatus_Set(USER_LED_STATE_SERVER_READY);
                        UserLedStatus_SetHttpFailed(false);
                        ESP_LOGI(TAG, "Network READY ip=" IPSTR " http=1 mdns=%d",
                                 IP2STR(&ip), s_mdns_service_started ? 1 : 0);
                    } else {
                        UserLedStatus_SetHttpFailed(true);
                        http_retry_count++;
                        status_enter_service_retry(http_retry_count, SERVER_NETWORK_STA_HTTP_RETRY_MS);
                        if (should_log_retry(http_retry_count)) {
                            ESP_LOGW(TAG, "HTTP service retry=%lu delay_ms=%u ret=%s",
                                     (unsigned long)http_retry_count,
                                     SERVER_NETWORK_STA_HTTP_RETRY_MS,
                                     esp_err_to_name(http_ret));
                        }
                    }
                } else {
                    if (candidate_config_valid &&
                        !candidate_selection_pending &&
                        ServerNetworkStaWifiSsidCandidateScan_PrepareRadio(
                            candidate_config.country) != ESP_OK) {
                        uint32_t retry_count = 0;
                        uint32_t delay_ms = next_wifi_retry(
                            &context, false, &retry_count);
                        status_enter_wifi_retry(retry_count, delay_ms, -1, 0);
                        continue;
                    }
                    if (candidate_selection_pending) {
                        esp_err_t select_ret = select_candidate_credential(
                            &candidate_config, &credential);
                        if (select_ret != ESP_OK) {
                            uint32_t retry_count = 0;
                            uint32_t delay_ms = next_wifi_retry(
                                &context, false, &retry_count);
                            status_enter_wifi_retry(retry_count, delay_ms, -1, 0);
                            continue;
                        }
                        candidate_selection_pending = false;
                    }
                    status_enter_connecting();
                    UserLedStatus_Set(USER_LED_STATE_WIFI_CONNECTING);
                    set_wifi_ps(WIFI_PS_NONE, "connecting");
                    esp_err_t ret = apply_wifi_config(&credential);
                    if (ret == ESP_OK) {
                        begin_connection_attempt(&context);
                        ret = esp_wifi_connect();
                    }
                    connection_deadline = xTaskGetTickCount() + pdMS_TO_TICKS(SERVER_NETWORK_STA_CONNECT_FLOW_TIMEOUT_MS);
                    if (ret != ESP_OK) {
                        uint32_t retry_count = 0;
                        uint32_t delay_ms = next_wifi_retry(&context, false, &retry_count);
                        status_enter_wifi_retry(retry_count, delay_ms, -1, 0);
                        if (should_log_retry(retry_count)) {
                            ESP_LOGW(TAG, "WiFi connect submit failed retry=%lu delay_ms=%lu ret=%s",
                                     (unsigned long)retry_count, (unsigned long)delay_ms,
                                     esp_err_to_name(ret));
                        }
                        complete_pending_requests(&pending_request_slot, &pending_request_id,
                                                  &coalesced_request_slot, &coalesced_request_id,
                                                  SERVER_NETWORK_STA_CONNECT_FAIL);
                    }
                }
            } else {
                status_set_last_result(snapshot.state == SERVER_NETWORK_STA_STATE_WAITING_IP
                                           ? TDX_JSON_RESULT_WIFI_GOT_IP_FAILED
                                           : TDX_JSON_RESULT_WIFI_CONNECT_TIMEOUT);
                server_network_sta_disconnect_purpose_t purpose =
                    snapshot.state == SERVER_NETWORK_STA_STATE_WAITING_IP
                        ? SERVER_NETWORK_STA_DISCONNECT_DHCP_RECOVERY
                        : SERVER_NETWORK_STA_DISCONNECT_CONNECT_RECOVERY;
                esp_err_t disconnect_ret = start_expected_disconnect(&context, purpose);
                if (disconnect_ret != ESP_OK) {
                    uint32_t retry_count = 0;
                    uint32_t delay_ms = next_wifi_retry(&context, false, &retry_count);
                    status_enter_wifi_retry(retry_count, delay_ms, -2, 0);
                    UserLedStatus_Set(USER_LED_STATE_WIFI_CONNECTING);
                    if (should_log_retry(retry_count)) {
                        ESP_LOGW(TAG, "WiFi timeout state=%d retry=%lu delay_ms=%lu",
                                 (int)snapshot.state, (unsigned long)retry_count,
                                 (unsigned long)delay_ms);
                    }
                }
                complete_pending_requests(&pending_request_slot, &pending_request_id,
                                          &coalesced_request_slot, &coalesced_request_id,
                                          SERVER_NETWORK_STA_CONNECT_FAIL);
            }
            continue;
        }

        if (event.type == WIFI_MANAGER_EVENT_RESYNC) {
            esp_ip4_addr_t current_ip = {0};
            if (connection_enabled && physical_link_has_ip(&current_ip)) {
                event.type = WIFI_MANAGER_EVENT_GOT_IP;
                event.ip = current_ip;
                ESP_LOGW(TAG, "WiFi event resync: physical link has IP");
            } else if (connection_enabled) {
                event.type = WIFI_MANAGER_EVENT_DISCONNECTED;
                event.reason = -4;
                ESP_LOGW(TAG, "WiFi event resync: physical link disconnected");
            } else {
                continue;
            }
        }

