tdxguiping/ESP32_S3_epaper/main/server_network_sta/server_network_sta.c
        if (event.type == WIFI_MANAGER_EVENT_CONNECT ||
            event.type == WIFI_MANAGER_EVENT_NEW_CREDENTIAL) {
            bool new_credential = event.type == WIFI_MANAGER_EVENT_NEW_CREDENTIAL;
            if (!new_credential && !event.force_reconnect &&
                pending_request_slot != SERVER_NETWORK_STA_INVALID_REQUEST_SLOT) {
                bool same_base_path = strcmp(event.base_path, base_path) == 0;
                if (same_base_path &&
                    coalesced_request_slot == SERVER_NETWORK_STA_INVALID_REQUEST_SLOT) {
                    coalesced_request_slot = event.request_slot;
                    coalesced_request_id = event.request_id;
                    ESP_LOGI(TAG,
                             "WiFi connect request joined active connect request_id=%lu active_request_id=%lu",
                             (unsigned long)event.request_id,
                             (unsigned long)pending_request_id);
                } else {
                    uint8_t rejected_slot = event.request_slot;
                    uint32_t rejected_id = event.request_id;
                    complete_pending_request(&rejected_slot, &rejected_id,
                                             SERVER_NETWORK_STA_CONNECT_SUPERSEDED);
                    ESP_LOGW(TAG, "WiFi connect request not joined request_id=%lu reason=%s",
                             (unsigned long)event.request_id,
                             same_base_path ? "join_slot_busy" : "base_path_mismatch");
                }
                continue;
            }
            complete_pending_requests(&pending_request_slot, &pending_request_id,
                                      &coalesced_request_slot, &coalesced_request_id,
                                      SERVER_NETWORK_STA_CONNECT_SUPERSEDED);
            pending_request_slot = event.request_slot;
            pending_request_id = event.request_id;
            if (event.base_path[0] != '\0') {
                strlcpy(base_path, event.base_path, sizeof(base_path));
            }
            memset(&candidate_config, 0, sizeof(candidate_config));
            candidate_config.selected_index = -1;
            candidate_config_valid =
                ServerNetworkStaWifiSsidCandidateStore_Load(&candidate_config) ==
                ESP_OK;
            candidate_selection_pending = candidate_config_valid &&
                (new_credential || candidate_config.selected_index < 0);
            if (candidate_config_valid && !candidate_selection_pending) {
                (void)credential_from_candidate_config(&candidate_config,
                                                       &credential);
#if SERVER_NETWORK_STA_LOG_PASSWORD_PLAINTEXT
                if (!event.suppress_password_log) {
                    ESP_LOGI(TAG,
                             "WiFi candidate credential loaded ssid=%s password=%s index=%d",
                             credential.display_ssid, credential.password,
                             (int)candidate_config.selected_index);
                } else {
                    ESP_LOGI(TAG,
                             "WiFi candidate credential loaded ssid=%s index=%d",
                             credential.display_ssid,
                             (int)candidate_config.selected_index);
                }
#else
                ESP_LOGI(TAG,
                         "WiFi candidate credential loaded ssid=%s index=%d",
                         credential.display_ssid,
                         (int)candidate_config.selected_index);
#endif
            } else if (candidate_config_valid) {
                memset(&credential, 0, sizeof(credential));
            } else {
                credential = read_saved_wifi(event.suppress_password_log);
            }
            connection_enabled = true;
            if (new_credential) {
                context.credential_generation++;
            }
            status_lock();
            s_status.credential_generation = context.credential_generation;
            status_unlock();
            clear_expected_disconnect(&context);
            reset_connection_health(&context);
            http_retry_count = 0;
            mdns_retry_count = 0;
            status_clear_retries();
            status_set_last_result(TDX_JSON_RESULT_WIFI_CONNECT_TIMEOUT);
            if (!credential.is_valid && !candidate_selection_pending) {
                connection_enabled = false;
                status_enter_terminal(SERVER_NETWORK_STA_STATE_NO_CONFIG,
                                      TDX_JSON_RESULT_WIFI_CONNECT_TIMEOUT, 0, 0);
                if (s_wifi_stack_ready) {
                    esp_err_t disconnect_ret = start_expected_disconnect(
                        &context, SERVER_NETWORK_STA_DISCONNECT_NO_CONFIG);
                    if (disconnect_ret != ESP_OK) {
                        status_enter_terminal(SERVER_NETWORK_STA_STATE_NO_CONFIG,
                                              TDX_JSON_RESULT_WIFI_CONNECT_TIMEOUT, 0, 0);
                    }
                }
                UserLedStatus_SetWifiNoConfig(true);
                (void)ch583_wifi_uart_send_wifi_provision_status(0);
                ESP_LOGW(TAG, "WiFi no saved credential");
                complete_pending_requests(&pending_request_slot, &pending_request_id,
                                          &coalesced_request_slot, &coalesced_request_id,
                                          SERVER_NETWORK_STA_NO_SAVED_WIFI);
                continue;
            }
            (void)ch583_wifi_uart_send_wifi_provision_status(1);
            esp_err_t ret = ensure_wifi_stack();
            if (ret != ESP_OK) {
                connection_enabled = false;
                status_enter_terminal(SERVER_NETWORK_STA_STATE_FAILED,
                                      TDX_JSON_RESULT_WIFI_CONNECT_TIMEOUT, 0, 0);
                UserLedStatus_SetFatalError(true);
                ESP_LOGE(TAG, "WiFi stack init failed ret=%s", esp_err_to_name(ret));
                complete_pending_requests(&pending_request_slot, &pending_request_id,
                                          &coalesced_request_slot, &coalesced_request_id,
                                          SERVER_NETWORK_STA_CONNECT_FAIL);
                continue;
            }
            UserLedStatus_Set(USER_LED_STATE_WIFI_CONNECTING);
            UserLedStatus_SetWifiNoConfig(false);
            UserLedStatus_SetWifiAuthFailed(false);
            if (candidate_config_valid && !candidate_selection_pending) {
                ret = ServerNetworkStaWifiSsidCandidateScan_PrepareRadio(
                    candidate_config.country);
                if (ret != ESP_OK) {
                    uint32_t retry_count = 0;
                    uint32_t delay_ms = next_wifi_retry(
                        &context, false, &retry_count);
                    status_enter_wifi_retry(retry_count, delay_ms, -1, 0);
                    ESP_LOGE(TAG,
                             "WiFi candidate radio prepare failed retry=%lu ret=%s",
                             (unsigned long)retry_count, esp_err_to_name(ret));
                    complete_pending_requests(
                        &pending_request_slot, &pending_request_id,
                        &coalesced_request_slot, &coalesced_request_id,
                        SERVER_NETWORK_STA_CONNECT_FAIL);
                    continue;
                }
            }
            if (candidate_selection_pending) {
                wifi_ap_record_t active_ap = {0};
                bool active_or_connecting =
                    esp_wifi_sta_get_ap_info(&active_ap) == ESP_OK ||
                    state_is_connect_flow(snapshot.state);
                if (active_or_connecting) {
                    ret = start_expected_disconnect(
                        &context, SERVER_NETWORK_STA_DISCONNECT_RECONFIGURE);
                    if (ret == ESP_OK) {
                        ESP_LOGI(TAG,
                                 "WiFi candidate selection waiting for disconnect credential_gen=%lu",
                                 (unsigned long)context.credential_generation);
                        continue;
                    }
                }
                ret = select_candidate_credential(&candidate_config, &credential);
                if (ret != ESP_OK) {
                    uint32_t retry_count = 0;
                    uint32_t delay_ms = next_wifi_retry(
                        &context, false, &retry_count);
                    status_enter_wifi_retry(retry_count, delay_ms, -1, 0);
                    ESP_LOGW(TAG,
                             "WiFi candidate scan pending retry=%lu delay_ms=%lu",
                             (unsigned long)retry_count,
                             (unsigned long)delay_ms);
                    complete_pending_requests(
                        &pending_request_slot, &pending_request_id,
                        &coalesced_request_slot, &coalesced_request_id,
                        SERVER_NETWORK_STA_CONNECT_FAIL);
                    continue;
                }
                candidate_selection_pending = false;
            }
            esp_ip4_addr_t current_ip = {0};
            if (!event.force_reconnect && same_active_config(&credential) &&
                physical_link_has_ip(&current_ip)) {
                event.type = WIFI_MANAGER_EVENT_GOT_IP;
                event.ip = current_ip;
            } else {
                wifi_ap_record_t ap = {0};
                bool connected = esp_wifi_sta_get_ap_info(&ap) == ESP_OK;
                bool connect_in_progress = state_is_connect_flow(snapshot.state);
                bool need_disconnect = connected || connect_in_progress;
                if (need_disconnect) {
                    ret = start_expected_disconnect(&context,
                                                    SERVER_NETWORK_STA_DISCONNECT_RECONFIGURE);
                    if (ret == ESP_OK) {
                        ESP_LOGI(TAG, "WiFi reconfigure pending credential_gen=%lu",
                                 (unsigned long)context.credential_generation);
                        continue;
                    }
                }
                {
                    ret = apply_wifi_config(&credential);
                    if (ret == ESP_OK) {
                        begin_connection_attempt(&context);
                        set_wifi_ps(WIFI_PS_NONE, "connecting");
                        status_enter_connecting();
                        ret = esp_wifi_connect();
                        connection_deadline = xTaskGetTickCount() + pdMS_TO_TICKS(SERVER_NETWORK_STA_CONNECT_FLOW_TIMEOUT_MS);
                    }
                }
                if (ret != ESP_OK) {
                    uint32_t retry_count = 0;
                    uint32_t delay_ms = next_wifi_retry(&context, false, &retry_count);
                    status_enter_wifi_retry(retry_count, delay_ms, -1, 0);
                    UserLedStatus_Set(USER_LED_STATE_WIFI_CONNECTING);
                    ESP_LOGW(TAG, "WiFi start failed retry=1 delay_ms=%lu ret=%s",
                             (unsigned long)delay_ms, esp_err_to_name(ret));
                    complete_pending_requests(&pending_request_slot, &pending_request_id,
                                              &coalesced_request_slot, &coalesced_request_id,
                                              SERVER_NETWORK_STA_CONNECT_FAIL);
                    continue;
                }
                ESP_LOGI(TAG, "WiFi connect start ssid=%s",
                         credential.display_ssid);
                continue;
            }
        }

        if (event.type == WIFI_MANAGER_EVENT_PROVISIONING) {
            complete_pending_requests(&pending_request_slot, &pending_request_id,
                                      &coalesced_request_slot, &coalesced_request_id,
                                      SERVER_NETWORK_STA_CONNECT_SUPERSEDED);
            reset_connection_health(&context);
            status_clear_retries();
            connection_enabled = false;
            if (s_wifi_stack_ready) {
                esp_err_t disconnect_ret = start_expected_disconnect(
                    &context, SERVER_NETWORK_STA_DISCONNECT_PROVISIONING);
                if (disconnect_ret != ESP_OK) {
                    status_enter_idle();
                }
            } else {
                status_enter_idle();
            }
            ESP_LOGI(TAG, "WiFi provisioning requested");
            continue;
        }

        if (event.type == WIFI_MANAGER_EVENT_STA_CONNECTED) {
            if (!connection_enabled ||
                context.disconnect_purpose != SERVER_NETWORK_STA_DISCONNECT_NONE) {
                continue;
            }
            if (!state_accepts_sta_connected(snapshot.state)) {
                ESP_LOGD(TAG, "Ignore STA_CONNECTED state=%s",
                         ServerNetworkSta_StateName(snapshot.state));
                continue;
            }
            esp_ip4_addr_t current_ip = {0};
            if (physical_link_has_ip(&current_ip)) {
                if (snapshot.has_ip) {
                    ESP_LOGW(TAG, "Ignore stale STA_CONNECTED event state=%s",
                             ServerNetworkSta_StateName(snapshot.state));
                    continue;
                }
                event.type = WIFI_MANAGER_EVENT_GOT_IP;
                event.ip = current_ip;
            } else {
                status_enter_waiting_ip();
                connection_deadline = xTaskGetTickCount() + pdMS_TO_TICKS(SERVER_NETWORK_STA_AP_OR_IP_TIMEOUT_MS);
                continue;
            }
        }

        if (event.type == WIFI_MANAGER_EVENT_GOT_IP) {
            if (!connection_enabled ||
                context.disconnect_purpose != SERVER_NETWORK_STA_DISCONNECT_NONE) {
                continue;
            }
            if (!state_accepts_got_ip(snapshot.state)) {
                ESP_LOGD(TAG, "Ignore GOT_IP state=%s",
                         ServerNetworkSta_StateName(snapshot.state));
                continue;
            }
            esp_ip4_addr_t current_ip = {0};
            if (!physical_link_has_ip(&current_ip)) {
                ESP_LOGW(TAG, "Ignore stale GOT_IP event");
                continue;
            }
            event.ip = current_ip;
            status_enter_got_ip(&event.ip);
            set_wifi_ps(SERVER_NETWORK_STA_CONNECTED_PS, "got_ip");
            ESP_LOGI(TAG, "WiFi GOT_IP ip=" IPSTR, IP2STR(&event.ip));

            status_enter_starting_services();
            esp_err_t mdns_ret = mdns_start_once();
            if (mdns_ret != ESP_OK) {
                uint32_t mdns_delay_ms = mdns_retry_delay_ms(mdns_retry_count++);
                status_set_mdns_retry(mdns_retry_count, mdns_delay_ms);
                ESP_LOGW(TAG, "mDNS unavailable retry=%lu delay_ms=%lu ret=%s",
                         (unsigned long)mdns_retry_count,
                         (unsigned long)mdns_delay_ms, esp_err_to_name(mdns_ret));
            } else {
                mdns_retry_count = 0;
                status_set_mdns_retry(0, 0);
            }
            esp_err_t http_ret = file_server_start_once(base_path);
            esp_ip4_addr_t verified_ip = {0};
            if (http_ret == ESP_OK && physical_link_has_ip(&verified_ip)) {
                status_enter_ready(&verified_ip);
                context.ready_stability_pending = true;
                context.ready_stable_deadline = xTaskGetTickCount() +
                    pdMS_TO_TICKS(SERVER_NETWORK_STA_READY_STABLE_RESET_MS);
                status_set_ready_stable_deadline(context.ready_stable_deadline);
                UserLedStatus_Set(USER_LED_STATE_SERVER_READY);
                UserLedStatus_SetHttpFailed(false);
                ESP_LOGI(TAG, "Network READY ip=" IPSTR " http=1 mdns=%d",
                         IP2STR(&verified_ip), s_mdns_service_started ? 1 : 0);
                complete_pending_requests(&pending_request_slot, &pending_request_id,
                                          &coalesced_request_slot, &coalesced_request_id,
                                          SERVER_NETWORK_STA_OK);
            } else {
                http_retry_count = 1;
                status_enter_service_retry(http_retry_count, SERVER_NETWORK_STA_HTTP_RETRY_MS);
                UserLedStatus_SetHttpFailed(true);
                ESP_LOGW(TAG, "HTTP service unavailable retry_ms=%u ret=%s",
                         SERVER_NETWORK_STA_HTTP_RETRY_MS, esp_err_to_name(http_ret));
                complete_pending_requests(&pending_request_slot, &pending_request_id,
                                          &coalesced_request_slot, &coalesced_request_id,
                                          SERVER_NETWORK_STA_CONNECT_FAIL);
            }
            continue;
        }

        if (event.type == WIFI_MANAGER_EVENT_LOST_IP) {
            if (!connection_enabled ||
                (snapshot.state == SERVER_NETWORK_STA_STATE_RETRY_WAIT &&
                 snapshot.retry_type == SERVER_NETWORK_RETRY_WIFI)) {
                continue;
            }
            if (physical_link_has_ip(NULL)) {
                ESP_LOGW(TAG, "Ignore stale LOST_IP event");
                continue;
            }
            server_network_sta_state_t old_state = snapshot.state;
            context.ready_stability_pending = false;
            context.ready_stable_deadline = 0;
            status_set_ready_stable_deadline(0);
            esp_err_t disconnect_ret = start_expected_disconnect(
                &context, SERVER_NETWORK_STA_DISCONNECT_DHCP_RECOVERY);
            if (disconnect_ret != ESP_OK) {
                uint32_t retry_count = 0;
                bool was_online = state_has_online_service(old_state);
                uint32_t delay_ms = next_wifi_retry(&context, was_online, &retry_count);
                status_enter_wifi_retry(retry_count, delay_ms, -3, 0);
                UserLedStatus_Set(USER_LED_STATE_WIFI_CONNECTING);
                ESP_LOGW(TAG, "WiFi LOST_IP retry=%lu delay_ms=%lu",
                         (unsigned long)retry_count, (unsigned long)delay_ms);
            }
            complete_pending_requests(&pending_request_slot, &pending_request_id,
                                      &coalesced_request_slot, &coalesced_request_id,
                                      SERVER_NETWORK_STA_CONNECT_FAIL);
            continue;
        }

        if (event.type == WIFI_MANAGER_EVENT_DISCONNECTED) {
            esp_ip4_addr_t current_ip = {0};
            if (connection_enabled && physical_link_has_ip(&current_ip)) {
                ESP_LOGW(TAG, "Ignore stale DISCONNECTED event reason=%d", event.reason);
                continue;
            }
            status_lock();
            server_network_sta_state_t old_state = s_status.state;
            status_unlock();
            context.ready_stability_pending = false;
            context.ready_stable_deadline = 0;
            status_set_ready_stable_deadline(0);

            server_network_sta_disconnect_purpose_t purpose = context.disconnect_purpose;
            uint32_t disconnect_credential_generation =
                context.disconnect_credential_generation;
            bool disconnect_was_online = context.disconnect_was_online;
            clear_expected_disconnect(&context);
            if (should_ignore_disconnected_event(old_state, purpose)) {
                ESP_LOGD(TAG, "Ignore DISCONNECTED state=%s reason=%d",
                         ServerNetworkSta_StateName(old_state), event.reason);
                continue;
            }
            if (purpose == SERVER_NETWORK_STA_DISCONNECT_RECONFIGURE) {
                if (disconnect_credential_generation != context.credential_generation) {
                    ESP_LOGD(TAG, "Ignore obsolete reconfigure event credential_gen=%lu active=%lu",
                             (unsigned long)disconnect_credential_generation,
                             (unsigned long)context.credential_generation);
                    atomic_store(&s_resync_required, true);
                    continue;
                }
                esp_err_t ret = ESP_OK;
                if (candidate_selection_pending) {
                    ret = select_candidate_credential(&candidate_config,
                                                      &credential);
                    if (ret == ESP_OK) {
                        candidate_selection_pending = false;
                    }
                }
                if (ret == ESP_OK) {
                    ret = apply_wifi_config(&credential);
                }
                if (ret == ESP_OK) {
                    begin_connection_attempt(&context);
                    set_wifi_ps(WIFI_PS_NONE, "connecting");
                    status_enter_connecting();
                    ret = esp_wifi_connect();
                    connection_deadline = xTaskGetTickCount() + pdMS_TO_TICKS(SERVER_NETWORK_STA_CONNECT_FLOW_TIMEOUT_MS);
                }
                if (ret == ESP_OK) {
                    continue;
                }
                uint32_t retry_count = 0;
                uint32_t delay_ms = next_wifi_retry(&context, false, &retry_count);
                status_enter_wifi_retry(retry_count, delay_ms, event.reason, event.rssi);
                if (should_log_retry(retry_count)) {
                    ESP_LOGW(TAG, "WiFi reconfigure failed retry=%lu delay_ms=%lu ret=%s",
                             (unsigned long)retry_count, (unsigned long)delay_ms,
                             esp_err_to_name(ret));
                }
                continue;
            }
            if (purpose == SERVER_NETWORK_STA_DISCONNECT_PROVISIONING) {
                status_enter_idle();
                continue;
            }
            if (purpose == SERVER_NETWORK_STA_DISCONNECT_NO_CONFIG) {
                status_enter_terminal(SERVER_NETWORK_STA_STATE_NO_CONFIG,
                                      TDX_JSON_RESULT_WIFI_CONNECT_TIMEOUT, 0, 0);
                continue;
            }
            if (!connection_enabled) {
                continue;
            }

