tdxguiping/ESP32_S3_epaper/main/server_network_sta/server_network_sta.c
            bool was_ready = disconnect_was_online || state_has_online_service(old_state);
            wifi_auth_failure_class_t auth_class = classify_auth_failure(event.reason);
            bool auth_limit_reached = false;
            if (auth_class == WIFI_AUTH_FAILURE_HARD) {
                context.hard_auth_failure_count++;
                context.transient_auth_failure_count = 0;
                auth_limit_reached = context.hard_auth_failure_count >=
                                     SERVER_NETWORK_STA_HARD_AUTH_FAILURE_LIMIT;
            } else if (auth_class == WIFI_AUTH_FAILURE_TRANSIENT) {
                context.transient_auth_failure_count++;
                context.hard_auth_failure_count = 0;
                auth_limit_reached = context.transient_auth_failure_count >=
                                     SERVER_NETWORK_STA_TRANSIENT_AUTH_FAILURE_LIMIT;
            } else {
                context.hard_auth_failure_count = 0;
                context.transient_auth_failure_count = 0;
            }
            if (auth_limit_reached) {
                connection_enabled = false;
                status_enter_terminal(SERVER_NETWORK_STA_STATE_AUTH_FAILED,
                                      TDX_JSON_RESULT_WIFI_AUTH_FAILED,
                                      event.reason, event.rssi);
                UserLedStatus_SetWifiAuthFailed(true);
                ESP_LOGW(TAG, "WiFi AUTH_FAILED reason=%d(%s) hard=%lu transient=%lu ssid=%s",
                         event.reason, disconnect_reason_name(event.reason),
                         (unsigned long)context.hard_auth_failure_count,
                         (unsigned long)context.transient_auth_failure_count,
                         credential.display_ssid);
                complete_pending_requests(&pending_request_slot, &pending_request_id,
                                          &coalesced_request_slot, &coalesced_request_id,
                                          SERVER_NETWORK_STA_CONNECT_FAIL);
                continue;
            }

            uint32_t retry_count = 0;
            if (candidate_config_valid &&
                event.reason == WIFI_REASON_NO_AP_FOUND) {
                candidate_selection_pending = true;
            }
            uint32_t delay_ms = next_wifi_retry(&context, was_ready, &retry_count);
            status_enter_wifi_retry(retry_count, delay_ms, event.reason, event.rssi);
            UserLedStatus_Set(USER_LED_STATE_WIFI_CONNECTING);
            if (should_log_retry(retry_count)) {
                ESP_LOGW(TAG, "WiFi disconnected reason=%d(%s) rssi=%d retry=%lu "
                         "delay_ms=%lu hard_auth=%lu transient_auth=%lu",
                         event.reason, disconnect_reason_name(event.reason), event.rssi,
                         (unsigned long)retry_count, (unsigned long)delay_ms,
                         (unsigned long)context.hard_auth_failure_count,
                         (unsigned long)context.transient_auth_failure_count);
            }
            if (auth_class == WIFI_AUTH_FAILURE_NONE) {
                complete_pending_requests(&pending_request_slot, &pending_request_id,
                                          &coalesced_request_slot, &coalesced_request_id,
                                          SERVER_NETWORK_STA_CONNECT_FAIL);
            }
        }
    }
}

esp_err_t ServerNetworkSta_Init(void)
{
    while (true) {
        portENTER_CRITICAL(&s_init_lock);
        if (s_init_state == WIFI_MANAGER_INIT_READY) {
            portEXIT_CRITICAL(&s_init_lock);
            return ESP_OK;
        }
        if (s_init_state == WIFI_MANAGER_INIT_NONE ||
            s_init_state == WIFI_MANAGER_INIT_FAILED) {
            s_init_state = WIFI_MANAGER_INIT_IN_PROGRESS;
            portEXIT_CRITICAL(&s_init_lock);
            break;
        }
        portEXIT_CRITICAL(&s_init_lock);
        vTaskDelay(pdMS_TO_TICKS(1));
    }

    esp_err_t init_result = ESP_OK;
    if (s_status_mutex == NULL) {
        s_status_mutex = xSemaphoreCreateMutexStatic(&s_status_mutex_buffer);
    }
    if (s_status_mutex == NULL) {
        init_result = ESP_ERR_NO_MEM;
        goto init_done;
    }
    if (s_request_mutex == NULL) {
        s_request_mutex = xSemaphoreCreateMutexStatic(&s_request_mutex_buffer);
    }
    if (s_request_mutex == NULL) {
        init_result = ESP_ERR_NO_MEM;
        goto init_done;
    }
    for (size_t i = 0; i < sizeof(s_request_slots) / sizeof(s_request_slots[0]); i++) {
        if (s_request_slots[i].semaphore == NULL) {
            s_request_slots[i].semaphore =
                xSemaphoreCreateBinaryStatic(&s_request_slots[i].semaphore_buffer);
        }
        if (s_request_slots[i].semaphore == NULL) {
            init_result = ESP_ERR_NO_MEM;
            goto init_done;
        }
    }
    if (s_wifi_manager_queue == NULL) {
        s_wifi_manager_queue = xQueueCreate(SERVER_NETWORK_STA_MANAGER_QUEUE_LENGTH,
                                            sizeof(wifi_manager_event_t));
    }
    if (s_wifi_manager_queue == NULL) {
        init_result = ESP_ERR_NO_MEM;
        goto init_done;
    }
    if (s_wifi_manager_task == NULL) {
        BaseType_t ret = xTaskCreate(server_network_sta_manager_task, "wifi_manager",
                                     SERVER_NETWORK_STA_MANAGER_STACK_SIZE, NULL,
                                     SERVER_NETWORK_STA_MANAGER_PRIORITY,
                                     &s_wifi_manager_task);
        if (ret != pdPASS) {
            s_wifi_manager_task = NULL;
            init_result = ESP_ERR_NO_MEM;
            goto init_done;
        }
    }

init_done:
    portENTER_CRITICAL(&s_init_lock);
    s_init_state = init_result == ESP_OK ? WIFI_MANAGER_INIT_READY : WIFI_MANAGER_INIT_FAILED;
    portEXIT_CRITICAL(&s_init_lock);
    return init_result;
}

esp_err_t ServerNetworkSta_GetStatus(server_network_sta_status_t *status)
{
    if (status == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (s_status_mutex == NULL) {
        *status = s_status;
        return ESP_OK;
    }
    status_lock();
    *status = s_status;
    TickType_t now = xTaskGetTickCount();
    status->wifi_retry_after_ms = s_wifi_retry_deadline != 0 &&
                                  (int32_t)(s_wifi_retry_deadline - now) > 0
                                      ? pdTICKS_TO_MS(s_wifi_retry_deadline - now) : 0;
    status->http_retry_after_ms = s_http_retry_deadline != 0 &&
                                  (int32_t)(s_http_retry_deadline - now) > 0
                                      ? pdTICKS_TO_MS(s_http_retry_deadline - now) : 0;
    status->mdns_retry_after_ms = s_mdns_retry_deadline != 0 &&
                                  (int32_t)(s_mdns_retry_deadline - now) > 0
                                      ? pdTICKS_TO_MS(s_mdns_retry_deadline - now) : 0;
    status->ready_stable_remaining_ms = s_ready_stable_deadline != 0 &&
                                        (int32_t)(s_ready_stable_deadline - now) > 0
                                            ? pdTICKS_TO_MS(s_ready_stable_deadline - now) : 0;
    status_unlock();
    return ESP_OK;
}

