tdxguiping/ESP32_S3_epaper/main/server_network_sta/server_network_sta.c
const char *ServerNetworkSta_StateName(server_network_sta_state_t state)
{
    switch (state) {
    case SERVER_NETWORK_STA_STATE_IDLE: return "IDLE";
    case SERVER_NETWORK_STA_STATE_NO_CONFIG: return "NO_CONFIG";
    case SERVER_NETWORK_STA_STATE_CONNECTING: return "CONNECTING";
    case SERVER_NETWORK_STA_STATE_WAITING_IP: return "WAITING_IP";
    case SERVER_NETWORK_STA_STATE_GOT_IP: return "GOT_IP";
    case SERVER_NETWORK_STA_STATE_STARTING_SERVICES: return "STARTING_SERVICES";
    case SERVER_NETWORK_STA_STATE_READY: return "READY";
    case SERVER_NETWORK_STA_STATE_RETRY_WAIT: return "RETRY_WAIT";
    case SERVER_NETWORK_STA_STATE_AUTH_FAILED: return "AUTH_FAILED";
    case SERVER_NETWORK_STA_STATE_DISCONNECTING: return "DISCONNECTING";
    case SERVER_NETWORK_STA_STATE_FAILED: return "FAILED";
    default: return "UNKNOWN";
    }
}

const char *ServerNetworkSta_DisconnectPurposeName(
    server_network_sta_disconnect_purpose_t purpose)
{
    switch (purpose) {
    case SERVER_NETWORK_STA_DISCONNECT_NONE: return "none";
    case SERVER_NETWORK_STA_DISCONNECT_RECONFIGURE: return "reconfigure";
    case SERVER_NETWORK_STA_DISCONNECT_CONNECT_RECOVERY: return "connect_recovery";
    case SERVER_NETWORK_STA_DISCONNECT_DHCP_RECOVERY: return "dhcp_recovery";
    case SERVER_NETWORK_STA_DISCONNECT_PROVISIONING: return "provisioning";
    case SERVER_NETWORK_STA_DISCONNECT_NO_CONFIG: return "no_config";
    default: return "unknown";
    }
}

int ServerNetworkSta_GetLastConnectResult(void)
{
    server_network_sta_status_t status = {0};
    (void)ServerNetworkSta_GetStatus(&status);
    return status.last_result;
}

void ServerNetworkSta_RequestProvisioning(void)
{
    if (ServerNetworkSta_Init() != ESP_OK) {
        ESP_LOGE(TAG, "WiFi provisioning manager init failed");
        return;
    }
    wifi_manager_event_t event = {
        .type = WIFI_MANAGER_EVENT_PROVISIONING,
    };
    post_manager_event(&event);
}

esp_err_t ServerNetworkSta_RequestNewCredentialAsync(const char *base_path)
{
    esp_err_t ret = ServerNetworkSta_Init();
    if (ret != ESP_OK) {
        return ret;
    }
    wifi_manager_event_t event = {
        .type = WIFI_MANAGER_EVENT_NEW_CREDENTIAL,
        .force_reconnect = true,
        .suppress_password_log = false,
        .request_slot = SERVER_NETWORK_STA_INVALID_REQUEST_SLOT,
    };
    strlcpy(event.base_path,
            base_path != NULL ? base_path : "/data",
            sizeof(event.base_path));
    if (xQueueSend(s_wifi_manager_queue, &event, pdMS_TO_TICKS(100)) != pdTRUE) {
        return ESP_ERR_TIMEOUT;
    }
    return ESP_OK;
}

static uint8_t submit_connect(const char *base_path, bool force_reconnect,
                              bool new_credential)
{
    if (ServerNetworkSta_Init() != ESP_OK) {
        return SERVER_NETWORK_STA_CONNECT_FAIL;
    }
    uint8_t request_slot = SERVER_NETWORK_STA_INVALID_REQUEST_SLOT;
    uint32_t request_id = 0;
    if (!allocate_request_slot(&request_slot, &request_id)) {
        return SERVER_NETWORK_STA_CONNECT_FAIL;
    }
    wifi_manager_event_t event = {
        .type = new_credential ? WIFI_MANAGER_EVENT_NEW_CREDENTIAL
                               : WIFI_MANAGER_EVENT_CONNECT,
        .force_reconnect = force_reconnect,
        .request_slot = request_slot,
        .request_id = request_id,
    };
    strlcpy(event.base_path, base_path != NULL ? base_path : "/data", sizeof(event.base_path));
    if (xQueueSend(s_wifi_manager_queue, &event, pdMS_TO_TICKS(100)) != pdTRUE) {
        (void)xSemaphoreTake(s_request_mutex, portMAX_DELAY);
        s_request_slots[request_slot].in_use = false;
        (void)xSemaphoreGive(s_request_mutex);
        return SERVER_NETWORK_STA_CONNECT_FAIL;
    }
    uint8_t result = SERVER_NETWORK_STA_CONNECT_FAIL;
    BaseType_t received = xSemaphoreTake(s_request_slots[request_slot].semaphore,
                                         pdMS_TO_TICKS(SERVER_NETWORK_STA_SYNC_REQUEST_TIMEOUT_MS));
    (void)xSemaphoreTake(s_request_mutex, portMAX_DELAY);
    if (received == pdTRUE && s_request_slots[request_slot].request_id == request_id) {
        result = s_request_slots[request_slot].result;
    }
    if (s_request_slots[request_slot].request_id == request_id) {
        s_request_slots[request_slot].in_use = false;
    }
    (void)xSemaphoreGive(s_request_mutex);
    if (received != pdTRUE) {
        ESP_LOGW(TAG, "WiFi connect request timeout request_id=%lu timeout_ms=%u",
                 (unsigned long)request_id, SERVER_NETWORK_STA_SYNC_REQUEST_TIMEOUT_MS);
    }
    return result;
}

uint8_t User_Network_mode_app_init(const char *base_path)
{
    return submit_connect(base_path, false, false);
}

uint8_t User_Network_mode_app_init_force(const char *base_path)
{
    return submit_connect(base_path, true, false);
}

uint8_t User_Network_mode_app_new_credential(const char *base_path)
{
    return submit_connect(base_path, true, true);
}
